#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

data.archive_file.bot: Reading...
data.google_secret_manager_secret_version.line_bot_channel_secret: Reading...
google_storage_bucket.bucket: Refreshing state... [id=haraiai-bucket]
data.google_secret_manager_secret_version.line_bot_channel_access_token: Reading...
data.archive_file.bot: Read complete after 1s [id=70d0f0a7506c647ab25a7060c96c410c5f981592]
google_storage_bucket_object.bot: Refreshing state... [id=haraiai-bucket-func/bot.8333501175c898323f3d2a5aeb02d6f7.zip]
data.google_secret_manager_secret_version.line_bot_channel_secret: Read complete after 1s [id=projects/900543910035/secrets/lineBotChannelSecret/versions/1]
data.google_secret_manager_secret_version.line_bot_channel_access_token: Read complete after 1s [id=projects/900543910035/secrets/lineBotChannelAccessToken/versions/1]
google_cloudfunctions_function.bot_webhook: Refreshing state... [id=projects/haraiai/locations/asia-northeast1/functions/BotWebhookHandler]
google_cloudfunctions_function_iam_member.webhook_invoker: Refreshing state... [id=projects/haraiai/locations/asia-northeast1/functions/BotWebhookHandler/roles/cloudfunctions.invoker/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions_function.bot_webhook will be updated in-place
  ~ resource "google_cloudfunctions_function" "bot_webhook" {
        id                           = "projects/haraiai/locations/asia-northeast1/functions/BotWebhookHandler"
        name                         = "BotWebhookHandler"
      ~ source_archive_object        = "func/bot.8333501175c898323f3d2a5aeb02d6f7.zip" -> "func/bot.8efbd14635d0602158c3202cdff38502.zip"
        # (19 unchanged attributes hidden)
    }

  # google_storage_bucket_object.bot must be replaced
-/+ resource "google_storage_bucket_object" "bot" {
      ~ content_type     = "application/zip" -> (known after apply)
      ~ crc32c           = "WJuVLA==" -> (known after apply)
      ~ detect_md5hash   = "gzNQEXXImDI/PSpa6wLW9w==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "haraiai-bucket-func/bot.8333501175c898323f3d2a5aeb02d6f7.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "gzNQEXXImDI/PSpa6wLW9w==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/haraiai-bucket/o/func%2Fbot.8333501175c898323f3d2a5aeb02d6f7.zip?generation=1687182203112530&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "func/bot.8333501175c898323f3d2a5aeb02d6f7.zip" -> "func/bot.8efbd14635d0602158c3202cdff38502.zip" # forces replacement
      ~ output_name      = "func/bot.8333501175c898323f3d2a5aeb02d6f7.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/haraiai-bucket/o/func%2Fbot.8333501175c898323f3d2a5aeb02d6f7.zip" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @raahii, Action: `pull_request`*